                               #ПОДПРОГРАММЫ.

      #Напишите программу, которая помогает пользователю лекго управлять списком имен.    
      #Программа должна выводить меню, дающее возможность добавлять, изменять и      
      #удалять имена из списка, а также отображать их все.  
      #Кроме того, в меню должна присутствовать команда для завершения работы программы .... 
                             
def add_name(): #1. Подпрограмма - добавить имя
  name = input("Enter a new name: ")
  names.append(name) #добавление имени в список  
  return names #возвращать значение переменной, иначе ошибка!      
      
def change_name(): #2. Подпрограмма - изменить имя в списке 
  num = 0
  for x in names: 
      print(num, x)
      num = num + 1 
  select_num = int(input("Enter the number of the name you want to change: "))
  name = input("Enter new name: ")
  names[select_num] = name #ввести новое имя под номером в список     
  return names 

def delete_name(): #3. Подпрограмма - удалить имя в списке
  num = 0
  for x in names:
      print(num, x)
      num = num + 1  
  select_num = int(input("Enter the number of the name you want to delete: "))       
  del names[select_num]     
  return names
  
def view_names(): #4. Подпрограмма  #отображение всего списка    
  for x in names:  #просмотр, посл редактирования 
      print(x)
  print() 
      
def main():  
  again = 'y' #повторять снова  
  while again == 'y':  
      print("1) Add a name")   #Выводим меню 
      print("2) Change a name")
      print("3) Delete a name")
      print("4) View names")
      print("5) Quit")
      print()
      
      selection = int(input("What do you want to do? "))
      
      if selection == 1: 
         names = add_name()
         
      elif selection == 2:
         names = change_name()
         
      elif selection == 3: 
         names = delete_name()
         
      elif selection == 4: 
         names = view_names()
         
      elif selection == 5: # Quit   
         again = "n"
         
      else: 
         print("Incorrect Enter! ")                   
         print("-------------")    
      data = (names, again)

names = []

main()



















 
















  











  



  
                        



 
     




















































  































         







 
   















   

















 
 












 
























  

  


















  






























  











































        








   



























     




























    
   

















   










    

    

















   

   





 








 














  













 



  


  






 
































  






 






























 

























































 




























     
 
     
 












   


  
      





























   





    

 

      



  

                 
        
  


    
 

             





 



  
  
  

  

  






 

  
   



  





  
  

  

 




    



 



  
  
  
  








  





  

 
  


  
  
 


  
 







        


 

 



 
 

 

 


  
 







