                                   # Занятие 2.    
                                # Переменные    
   
x = 3.8e3  # 3.8 * 10^3  # c "e" - позвояет записывать больше знаков, после запятой 
print(x) 
print()  

x = 3.8e-3  # 3.8 * 10^(-3) 
print(x)
print()

print( 2 * 3 )   #позволяет проводить арифм. действия в print 
print()  

print( 2  ** 3 )   # в степени  
print()  

print( 4  ** 0.5 )   #представление квадратного корня из 4  
print()

print(  7 %  2 )   #остаток от деления   
print()

#приоритеты операции:
#  **  |   * | /   //  %  | +   -
# иначе использовать скобки

number = 15
number += 5  #арифметические операции с присвоением 
print( number )  
print()
  
print( 1/3 + 1/3 + 1/3 )   #здесь погрешность от деления до 1 
print() 

#number1 = "5"  #описан, как строковый тип  
#number2 = 5
#sum = number1 + number2   #перед number1 поставить int и поставить скобки 
#print(sum)   #иначе ошибка!!!   







